using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace StopWords
{
    public class StWdsRus
    {
        public string[] Rus = {
                                        "1","2","3","4","5","6","7","8","9","0", 
                                        "а",
"б", "без","буд", "больш", "был","бы",
"в", "вам", "вас","во","вс","всех", "всегда", "ведь", "вот", "впрочем", "вдруг", "вмест",
"где", "говор",
"даже","до", "для", "да", "дел", 
"ее","есть","ему", "его", "ее", "ей", "если", "еще", "ег","ест", 
"ж", "же",
"здес", "зач", "з", "занима","за",
"из","им", "и", "из-за", "или", "им", "иногд","ил",
"к","ко","кто", "как", "когд", "котор", "куд",
"либо", "ли",
"может", "между", "мен", "мне", "мног", "мож", "мог", "можн", "м","мы",
"но","наш","него","нет","них","ну", "надо", "наконец", "нас", "н", "нибуд", "ним", "ни", "не", "на", "называ", "назван", "назва", "ними","например","нам","нача",
"о","от", "он", "обычн", "основа", "об",
"по","при", "перед", "пред", "под", "про", "побыва","п",
"род",
"со", "с", "сам", "св", "сво", "своих", "себ", "сказа", "скаж", "стат", "стал", "станов",
"тем", "т", "так", "теб", "тепер", "там", "тот", "тех", "тут", "то","том", 
"у","уж",
"ч","чтоб", "что", "част","чем",
"эт", "этот",
"я", "явля"};
        public bool Check(string s)
        {
            foreach (string elem in Rus)
            {
                if (s == elem) return true;
            }
            return false;
        }
    }
}
